src/InformationRegisters/кфкПараметрыОчисткиХранилища/кфкПараметрыОчисткиХранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>кфкПараметрыОчисткиХранилища</name>
  <resources>
    <name>СрокХраненияОбработанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокХраненияОтмененныхВходящих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокХраненияОтмененныхИсходящих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокХраненияОтправленных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокХраненияОшибкиОбработкиВходящих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокХраненияОшибкиОбработкиИсходящих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокХраненияОшибкиОтправки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокХраненияНезавершенных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокХраненияХэшСуммыСообщений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

src/InformationRegisters/кфкПараметрыОчисткиХранилища/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

// @strict-types
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыбраннаяФорма = Метаданные.Обработки.кфкПанельАдминистрирования.ОсновнаяФорма;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьПараметры() Экспорт
	
	Результат = Новый Структура;
	
	// Общие для очереди
	Результат.Вставить("СрокХраненияНезавершенных", 7);
	
	// ИсходящиеСообщения
	Результат.Вставить("СрокХраненияОшибкиОбработкиИсходящих", 3);
	Результат.Вставить("СрокХраненияОтмененныхИсходящих", 1);
	Результат.Вставить("СрокХраненияОшибкиОтправки", 3);
	Результат.Вставить("СрокХраненияОтправленных", 1);
	
	// ВходящиеСообщения
	Результат.Вставить("СрокХраненияОшибкиОбработкиВходящих", 3);
	Результат.Вставить("СрокХраненияОтмененныхВходящих", 1);
	Результат.Вставить("СрокХраненияОбработанных", 1);
	
	// Прочее
	Результат.Вставить("СрокХраненияХэшСуммыСообщений", 3);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	кфкПараметрыОчисткиХранилища.СрокХраненияНезавершенных КАК СрокХраненияНезавершенных,
	|	кфкПараметрыОчисткиХранилища.СрокХраненияОбработанных КАК СрокХраненияОбработанных,
	|	кфкПараметрыОчисткиХранилища.СрокХраненияОтмененныхВходящих КАК СрокХраненияОтмененныхВходящих,
	|	кфкПараметрыОчисткиХранилища.СрокХраненияОтмененныхИсходящих КАК СрокХраненияОтмененныхИсходящих,
	|	кфкПараметрыОчисткиХранилища.СрокХраненияОтправленных КАК СрокХраненияОтправленных,
	|	кфкПараметрыОчисткиХранилища.СрокХраненияОшибкиОбработкиВходящих КАК СрокХраненияОшибкиОбработкиВходящих,
	|	кфкПараметрыОчисткиХранилища.СрокХраненияОшибкиОбработкиИсходящих КАК СрокХраненияОшибкиОбработкиИсходящих,
	|	кфкПараметрыОчисткиХранилища.СрокХраненияОшибкиОтправки КАК СрокХраненияОшибкиОтправки,
	|	кфкПараметрыОчисткиХранилища.СрокХраненияХэшСуммыСообщений КАК СрокХраненияХэшСуммыСообщений
	|ИЗ
	|	РегистрСведений.кфкПараметрыОчисткиХранилища КАК кфкПараметрыОчисткиХранилища";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		
	ИначеЕсли кфкОбщегоНазначенияСлужебный.ЭтоПолноправныйПользователь() Тогда
		ОбновитьПараметры(Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ОбновитьПараметры(НовыеПараметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Набор = СоздатьНаборЗаписей();
	ЗаполнитьЗначенияСвойств(Набор.Добавить(), НовыеПараметры);
	Набор.ОбменДанными.Загрузка = Истина;
	Набор.Записать();
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
